---
kind: property
id: P:Autodesk.Revit.DB.MEPConnectorInfo.IsSecondary
source: html/2a9f10fb-0971-9117-ada5-95540dfe94b6.htm
---
# Autodesk.Revit.DB.MEPConnectorInfo.IsSecondary Property

True if this is the secondary connector.

## Syntax (C#)
```csharp
public bool IsSecondary { get; }
```